Tekla Open API Reference for Tekla Structures 2025
ModuleManager Class
 The ModuleManager class handles the product model module configuration information: the information that defines what configuration the customer is currently running.
Inheritance Hierarchy
System.Object
 Tekla.Structures.ModuleManager
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class ModuleManager
Public NotInheritable Class ModuleManager
The ModuleManager type exposes the following members.
Constructors
Name | Description
ModuleManager
Initializes a new instance of the ModuleManager class
Top
Properties
Name | Description
AnalysisAndDesign
 Indicates whether the Analysis and Design management is enabled.
CIPModeling
 Indicates whether the CIP modeling is enabled.
ConcreteDetailing
 Indicates whether the concrete detailing is enabled.
Configuration
 The currently running configuration of Tekla Structures.
LoadModeling
 Indicates whether the load modeling is enabled.
MultimaterialModeling
 Indicates whether the multimaterial modeling is enabled.
RebarModeling
 Indicates whether the rebar modeling is enabled.
SteelDetailing
 Indicates whether the steel detailing is enabled.
TaskManagement
 Indicates whether the task management is enabled.
Top
See Also
Reference
Tekla.Structures Namespace